In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
ruta = r'D:\0_Respaldo\0_Proyectos_2024\ML_proyects\titanic\titanic\data\clean\clean.parquet'

In [3]:
data = pd.read_parquet(ruta)

In [4]:
data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,cero,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,cero,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,cero,S

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [21]:
df = data.copy()

In [22]:
del df['PassengerId']
del df['Name']
del df['Ticket']
del df['Cabin']

In [23]:
df.head(5)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  891 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [25]:
df['Embarked'].value_counts()

Embarked
S       644
C       168
Q        77
cero      2
Name: count, dtype: int64

In [26]:
df['Embarked'] = df['Embarked'].replace(['S','C','Q','cero'] ,[1,2,3,0])

C:\Users\USUARIO\AppData\Local\Temp\ipykernel_18752\3364081171.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['Embarked'] = df['Embarked'].replace(['S','C','Q','cero'] ,[1,2,3,0])

In [28]:
df['Sex'] = df['Sex'].replace(['male','female'] ,[0,1])

C:\Users\USUARIO\AppData\Local\Temp\ipykernel_18752\3014510888.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['Sex'] = df['Sex'].replace(['male','female'] ,[0,1])

In [29]:
df.sample(15)

     Survived  Pclass  Sex        Age  SibSp  Parch      Fare  Embarked
295         0       1    0  29.699118      0      0   27.7208         2
766         0       1    0  29.699118      0      0   39.6000         2
178         0       2    0  30.000000      0      0   13.0000         1
471         0       3    0  38.000000      0      0    8.6625         1
235         0       3    1  29.699118      0      0    7.5500         1
879         1       1    1  56.000000      0      1   83.1583         2
647         1       1    0  56.000000      0      0   35.5000         2
399         1       2    1  28.000000      0      0   12.6500         1
420         0       3    0  29.699118      0      0    7.8958         2
757         0       2    0  18.000000      0      0   11.5000         1
655         0       2    0  24.000000      2      0   73.5000         1
232         0       2    0  59.000000      0      0   13.5000         1
380         1       1    1  42.000000      0      0  227.5250         2
33          0       2    0  66.000000      0      0   10.5000         1
794         0       3    0  25.000000      0      0    7.8958         1

In [30]:
df.to_parquet(r'D:\0_Respaldo\0_Proyectos_2024\ML_proyects\titanic\titanic\data\clean\ready.parquet')